# ShortCurveTolerance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ShortCurveTolerance Property
Application Class See Also
---
The enforced minimum length for any curve created by Revit.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double ShortCurveTolerance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ShortCurveTolerance As Double
	Get
```

Visual C++
---
```text
public:
property double ShortCurveTolerance {
	double get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace